{
  "version": "v9.6.0",
  "releaseDate": "February 27, 2026",
  "summary": "Stable release: Fluid Limit Wizard, Advanced Analytics overhaul (Morning Patterns, PPH Detection, Daily Fluid Trend, Smarter Insights), expanded condition-specific symptoms, redesigned Device Sync with import preview, and three UX fixes.",
  "whatsNew": [
    "🪄 Fluid Limit Setup Wizard (Path A prescribed + Path B guided estimate) — beta.1",
    "📋 Doctor Question Router — smart appointment targeting instead of silent staging — beta.1",
    "💧 Daily Fluid Trend Chart — bar chart showing total fluid logged per day with your limit as a dashed red line, color-coded green/amber/red — beta.2",
    "🌅 Morning Patterns Panel — connects Morning Check-In data to analytics: feeling distribution, fluid over-limit vs next-morning feeling table, sleep correlation, top symptoms. Requires 5+ check-ins in the selected period — beta.2",
    "🍽️ Post-Meal BP Patterns (PPH Detection) — analyzes BP readings before and after logged meals to surface consistent post-meal drops. For pattern tracking only, not medical advice — beta.2",
    "💡 Smarter Key Insights — plain-language card summaries replacing the old bullet dump: BP Overview, Fluid Behavior, Morning Pattern Summary, Weight Change, Activity — beta.2",
    "🩺 Expanded Condition-Specific Symptoms (beta.3) — All 19 named cardiac conditions mapped with clinically relevant trackable symptoms. CAD, PAD, Arrhythmia, SSS, Bradycardia, Tachycardia, Cardiomyopathy, Orthostatic Hypotension, OSA, Diabetes, TIA/Stroke, Venous Insufficiency and more now surface automatically in the symptom selector when selected in Settings.",
    "🔧 Fix: Appointment widget restructured — no more narrow column layout. Full-width card with date/doctor/reason in a clean header row and detail sections below (beta.4)",
    "🔧 Fix: Event order now consistent across Settings, Fluid Budget Dashboard, and all views — respects your manual ↑↓ sort order (beta.4)",
    "🔧 Fix: Log BP medication tracking is now context-aware — shows your already-logged meds as one-tap buttons instead of making you reselect from a dropdown (beta.4)",
    "🔄 Device Sync redesigned (beta.5) — Backup freshness indicator (Today / X days ago / Never) shown in both Settings and the sync modal. Step-by-step guidance with device-specific tips (iPhone AirDrop, Files app, email). Import now shows a full preview — BP readings count, days of data, medications, patient name — before overwriting anything. Backup Now button added to Settings so you never have to dig into the sync modal just to export."
  ],
  "fixes": []
}